Repository: MarcoKoch/sphinx-cmake_domain
Catalog: sphinx_ext/locale/*/LC_MESSAGES/sphinx-cmake_domain.po
Languages: de

source: A node of type {node_type} was encountered outside a {paramlist_node_type}.
de: Ein Knoten des Typs {node_type} wurde außerhalb eines {paramlist_node_type} aufgefunden.

source: Encountered nested {paramlist_node_type} nodes. Outer node defined here: {source_file}, {line}
de: Verschachtelte Knoten des Typs {paramlist_node_type} aufgefunden. Der äußere Knoten wurde hier definiert: {source_file}, {line}

source: depart_node() called on this node without previous call to visit_node() with the same translator
de: depart_node() wurde auf diesem Knoten aufgerufen, ohne zuvor visit_node() mit dem selben Übersetzer darauf auszuführen

source: Type
de: Typ

source: Default value
de: Standardwert

source: Invalid variable signature: {sig}
de: Unzulässige Variablensignatur: {sig}

source: Parameters
de: Parameter

source: Unexpected text at column {pos}: {unexpected}
de: Unerwarteter Text in Spalte {pos}: {unexpected}

source: Unexpected token at position {pos}: {raw} ({token_type})
de: Unerwarteter Token an Position {pos}: {raw} ({token_type})

source: Unexpected end of parameter list
de: Unerwartetes Ende der Parameterliste

source: Invalid macro/function signature: {sig}
de: Unzulässige Makro-/Funktionssignatur: {sig}

source: Failed to parse parameters for macro/function {name}: {msg}
de: Fehler beim Einlesen der Parameter des Makros/der Funktion {name}: {msg}

source: macro/function
de: Makro/Funktion

source: module
de: Modul

source: target
de: Ziel

source: Duplicate description of {typ} {name}: Previously described in {other_docname}. Use :noindex: with one of them.
de: Mehrfache Beschreibung von {typ} {name}: Zuvor beschrieben in {other_docname}. Nutzen Sie :noindex: mit einer der Beschreibungen.

source: Xref role '{role}' does not reference an object type from the CMake domain
de: Querverweisrolle '{role}' referenziert keinen Objekttypus aus der CMake-Domäne

source: '{str}' is not a known CMake object type
de: '{str}' ist kein bekannter CMake-Objekttyp
